Revit 2027 API
BuiltInFailures.ExtrusionFailures.InvalidExtrusionCurveloop Property
 Base sketch for extrusion is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidExtrusionCurveloop { get; }
Public Shared ReadOnly Property InvalidExtrusionCurveloop As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidExtrusionCurveloop {
	FailureDefinitionId^ get ();
}
static member InvalidExtrusionCurveloop : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ExtrusionFailures Class
Autodesk.Revit.DB Namespace